// hw03.rs

fn main() {
    const WIDTH: usize = 10; // ширина конверта
    const HEIGHT: usize = 5; // висота конверта

    // Малюємо верхню частину конверта
    for i in 0..WIDTH {
        if i == 0 || i == WIDTH - 1 {
            print!("*"); // Малюємо краю
        } else {
            print!(" "); // Малюємо порожні місця
        }
    }
    println!(); // Переходимо на новий рядок

    // Малюємо середину конверта
    for _ in 0..HEIGHT - 2 {
        print!("*"); // Ліва частина конверта
        for _ in 0..WIDTH - 2 {
            print!(" "); // Простір всередині
        }
        print!("*"); // Права частина конверта
        println!(); // Переходимо на новий рядок
    }

    // Малюємо нижню частину конверта
    for i in 0..WIDTH {
        if i == 0 || i == WIDTH - 1 {
            print!("*"); // Малюємо краю
        } else {
            print!(" "); // Малюємо порожні місця
        }
    }
    println!(); // Переходимо на новий рядок
}

